---
type: RebarShapeMultiplanarDefinition
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 9
tags: [revit-api, class]
---

# RebarShapeMultiplanarDefinition

`Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeMultiplanarDefinition | — | `public RebarShapeMultiplanarDefinition ( double outOfPlaneBendDiameter )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | SetPresenceOfSegments | — | `public void SetPresenceOfSegments ( bool isDuplicateShapePresent , bool isStartConnectorPresent , bool isEndConnectorPresent )` |
| Property | DepthParamId | — | `public ElementId DepthParamId { get ; set ; }` |
| Property | IsDuplicateShapePresent | — | `public bool IsDuplicateShapePresent { get ; }` |
| Property | IsEndConnectorPresent | — | `public bool IsEndConnectorPresent { get ; }` |
| Property | IsStartConnectorPresent | — | `public bool IsStartConnectorPresent { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OutOfPlaneBendDiameter | — | `public double OutOfPlaneBendDiameter { get ; set ; }` |